In [4]:
import pandas as pd
from sklearn.utils import resample
df=pd.DataFrame({
    'Age':[22,25,27,28,30,35,40,45,50,55,60,65,70],
    'Income':[2000,2500,2700,3200,3500,3800,4000,4200,4300,4500,5000,5500,6000],
    'Class':['High','low','low','High','High','low','High','High','low','low','High','High','low']
})

In [6]:
df_high=df[df['Class']=='High'] #separate majority and minority classes
df_low=df[df['Class']=='low']

In [15]:
df_high

    Age  Income Class
0    22    2000  High
3    28    3200  High
4    30    3500  High
6    40    4000  High
7    45    4200  High
10   60    5000  High
11   65    5500  High

In [16]:
#Downsample majority class
df_high_downsampled=resample(df_high,replace=False,n_samples=len(df_low),random_state=42)

In [17]:
#Combine downsampled majority with minority class
df_balanced=pd.concat([df_high_downsampled,df_low])

In [18]:
df_balanced['Class'].value_counts()

Class
High    6
low     6
Name: count, dtype: int64

In [20]:
df_high_downsampled

    Age  Income Class
0    22    2000  High
3    28    3200  High
10   60    5000  High
4    30    3500  High
7    45    4200  High
6    40    4000  High

In [22]:
df_balanced

    Age  Income Class
0    22    2000  High
3    28    3200  High
10   60    5000  High
4    30    3500  High
7    45    4200  High
6    40    4000  High
1    25    2500   low
2    27    2700   low
5    35    3800   low
8    50    4300   low
9    55    4500   low
12   70    6000   low

In [59]:

df_low_upsampling=resample(df_low,replace=True,n_samples=len(df_low),random_state=42)

In [60]:
df_balanced=pd.concat([df_low_upsampling,df_high])

In [61]:
df_balanced['Class'].value_counts()

Class
High    7
low     6
Name: count, dtype: int64

In [62]:
df_low_upsampling

   Age  Income Class
8   50    4300   low
9   55    4500   low
5   35    3800   low
9   55    4500   low
9   55    4500   low
2   27    2700   low

In [54]:
df_majority=df[df['Class']=='High']
df_minority=df[df['Class']=='low']

In [55]:
df_minority_unsampled=resample(df_minority,replace=True,n_samples=len(df_majority),random_state=42)

In [56]:
df_balanced=pd.concat([df_majority,df_minority_unsampled])

In [57]:
print(df_balanced['Class'].value_counts())

Class
High    7
low     7
Name: count, dtype: int64

In [58]:
df_minority_unsampled

   Age  Income Class
8   50    4300   low
9   55    4500   low
5   35    3800   low
9   55    4500   low
9   55    4500   low
2   27    2700   low
5   35    3800   low